app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "gabita"], ["email", "gabita@example.com"], ["password", "gabita"], ["created_at", "2019-10-07 23:28:39.364601"], ["updated_at", "2019-10-07 23:28:39.364601"]]
---
  def create
    #@user = User.new(username: params[:username], email: params[:email], password: params[:password])
    @user = User.new user_params
    if @user.save